tests/load/artillery/ws-load.yml
# tests/load/artillery/ws-load.yml
# Artillery нагрузочный тест WebSocket
#
# Запуск:
#   artillery run tests/load/artillery/ws-load.yml
#   artillery run --output report.json tests/load/artillery/ws-load.yml
#   artillery report report.json

config:
  target: "ws://localhost:3118"
  phases:
    - name: "warmup"
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: "sustained load"
      duration: 300
      arrivalRate: 20
    - name: "peak load"
      duration: 60
      arrivalRate: 20
      rampTo: 100
    - name: "cool down"
      duration: 60
      arrivalRate: 100
      rampTo: 5
  ws:
    subprotocols: []
    rejectUnauthorized: false
  variables:
    subscribeFilters:
      - '{"type": "prediction"}'
      - '{"type": "alert"}'
      - '{"minLevel": "high"}'
      - '{"signal": "ising"}'
      - '{}'
  ensure:
    maxErrorRate: 1
    thresholds:
      - "vusers.failed": 10
      - "http.response_time.p95": 500
  plugins:
    expect: {}
    metrics-by-endpoint: {}

scenarios:
  - name: "subscribe_and_receive"
    weight: 60
    engine: ws
    flow:
      - connect: "ws://localhost:3118"
      - function: "onConnect"
      - think: 1
      - send: '{"action": "subscribe", "filters": {"type": "prediction"}}'
      - think: 2
      - send: '{"action": "ping"}'
      - think: 5
      - send: '{"action": "stats"}'
      - think: 3
      - send: '{"action": "unsubscribe"}'
      - think: 1
      - function: "closeConnection"

  - name: "high_frequency_pings"
    weight: 30
    engine: ws
    flow:
      - connect: "ws://localhost:3118"
      - loop:
          - send: '{"action": "ping"}'
          - think: 0.5
        count: 20
      - function: "closeConnection"

  - name: "subscriber_only"
    weight: 10
    engine: ws
    flow:
      - connect: "ws://localhost:3118"
      - send: '{"action": "subscribe", "filters": {}}'
      - think: 30
      - function: "closeConnection"